{
  "data": [
    {
      "_version_": 1760665537260552192,
      "diagnostic_procedures": [
        "Exercise stress test",
        "Stress Test",
        "12 lead ECG",
        "Diagnosis"
      ],
      "diseases": [
        "Cardiomyopathies",
        "Harlequin Fetus",
        "Coronary Arteriosclerosis",
        "Myocardial Ischemia",
        "Ischemic cardiomyopathy",
        "Disease",
        "Vascular Diseases",
        "Pneumocystis jiroveci pneumonia",
        "Paramyotonia Congenita (disorder)",
        "Left Bundle-Branch Block",
        "Headache Disorders, Secondary",
        "MICROCEPHALY, EPILEPSY, AND DIABETES SYNDROME",
        "Hypertensive disease"
      ],
      "id": "bc137ee9-784e-4e95-9bf6-ef10ccf167b9",
      "post_comments": [
        " I have 50% blockage beside the a fib and regurgitation left ventricle. Enlarged heart I can’t seem to find a good cardiologist. Hello @swenglert, Welcome to Connect. we’re so glad you’ve joined us, and thank you for sharing your history. Here’s what I found: “Cardiac cephalgia is a type of secondary headache disorder, usually initiated by exertion that is related to myocardial ischemia.” https://www.ncbi.nlm.nih.gov/pubmed/25819974 I’m tagging @bibi12 @amynewheart @fr0ggie @murryone @jms7 @cynaburst, who have experience with cardiomyopathy, and you may also be interested in these discussions on cardiomyopathy: – https://connect.mayoclinic.org/discussion/what-is-cardiomyopathy-can-you-explain-systolic-cardiomyopathy-how-about-diastolic-cardiomyopathy/ – https://connect.mayoclinic.org/discussion/dilated-cardiomyuopathy-meds/ – https://connect.mayoclinic.org/discussion/cardiomyopathy/ While we wait for members to join in, I’d also encourage you to read this information from Mayo Clinic about myocardial ischemia: http://www.mayoclinic.org/diseases-conditions/myocardial-ischemia/basics/definition/con-20035096 @swenglert, have the doctors explained what type of cardiomyopathy you might have? In reply to @carnes \"I have 50% blockage beside the a fib and regurgitation left ventricle. Enlarged heart I can't...\" + (show) Hi, Carnes. You have enough issues, symptoms and signs to raise a high suspicion of primary systemic cardiac amyloidosis, along with the blockage. Even the blockage could be secondary to an Amy…. The A-Fib can be non-valve related, but come from Amy in the sensori-motor nerves between sections of the heart, or between the heart and brain, or in the brain. The enlarged heart is typical (75%) Cardiac AL Amy, especially if the QRS tracing on a 12-lead of either ventricle or atrial wall(s) show low voltage, under .5mv, or <about half what a typical enlarged heart cardiomyopathy will show. If you can, start with a good hematologist. Ask them to run a FreeLiteChain@ and a 12-lead ecg on you, for starters. If you are not sure of the hematologist’ expertise, demand that they send the results to a skilled and experienced center such as Mayo-Rochester, Memorial Sloan-Kettering, City of Hope, Brigham & Women’s, Etc. Some doctors won’t do this, so head out the door and take a vacation in Rochester, Philly, Boston or LA, and check with the experienced center directly. It might be the best vacation you have ever had. Save your life, or at least make it longer. In reply to @kanaazpereira \"Hello @swenglert, Welcome to Connect. we're so glad you've joined us, and thank you for sharing...\" + (show)        Hi @kanaazpereire According to CC, I have non-ischemic cardiomyopathy. That’s my confusion with the cardiac headaches. i really don’t have blockages for the rare symptom. The small vessel disease could be causing it which is also rare. In reply to @kanaazpereira \"Hello @swenglert, Welcome to Connect. we're so glad you've joined us, and thank you for sharing...\" + (show)        Hi @swenglert, Thank you for the update. Here’s a more recent article on Non-Ischemic Cardiomyopathy that you may wish to view: https://www.ncbi.nlm.nih.gov/pmc/articles/PMC5089491/ I’m also tagging Mentor @predictable, as he may have some more insight for you."
      ],
      "post_content": [
        "hi... everyone.. i'm new to mayo clinic's discussion. from pittsburgh. not sure where to start.....\nmy heart issues started in 2011 when i was diagnosed with a lbbb, everything was going good. my cardiologist was even going to take me off the bp medicine in 2015. late 2015, i started having the same symptoms after doing stuff around the house. dizziness, lightheaded, pressure up left side of neck which lead to nausea and dry heaves. my cardiologist decides to do a stress test..... result an ef rate below 34%. after 4 days in the hospital in jan. 2016 and a new cardiologist, i felt great with the new medicine. even though my ef rate increase to 40%, i could not shake the old symptoms. in the fall of 2016, i got to the point that i couldn't carry my granddaughter at the pumpkin patch without shortness of breathe. went back to my new cardiologist, he told me you have cardiomyopathy, but there's no blockages. it could be small vessel disease but not sure. go back to your pcp. the pcp told me it was my heart....and i needed to get a 2nd opinion. at that point, besides the all the above symptoms, the pressure in the neck was getting it my left temple and jaw causing pain and a extreme headache. my wife and i decided to go to cc for the 2nd opinion. after 3 trips, i got no direction from the cardiologists but that i have cardiomyopathy with hypertension due to exertion and a heart that has 3 valves slightly leaking. all they did at cc was raise my bp and coreg medicine. back to pittsburgh. now 8 months later still have no answers, just found out that the headaches are cardiac headaches [i think the term the neurologist said was \"cardiac cephalgia\"] had to suspend my cardiac rehab due to the pressure and headache pain in the left side. so there is my point, not sure what's causing the issues or why? with 2 possible issues that are vary rare????/"
      ],
      "post_group": [
        "Heart & Blood Health"
      ],
      "post_title": [
        "non-ischemic cardiomyopathy: need a direction ->"
      ],
      "post_url": [
        "https://connect.mayoclinic.org/discussion/need-a-direction/"
      ],
      "symptoms": [
        "Headache",
        "Regurgitation",
        "Lightheadedness",
        "Retching",
        "Tremor",
        "Jaw pain",
        "Nausea",
        "side pain",
        "Pain",
        "Dizziness",
        "Vertigo"
      ]
    },
    {
      "_version_": 1760665153993441280,
      "diagnostic_procedures": [
        "Plain chest X-ray",
        "subharmonic aided pressure estimation",
        "Echocardiography",
        "Electrocardiography"
      ],
      "diseases": [
        "Myocardial Infarction",
        "Harlequin Fetus",
        "Dehydration"
      ],
      "id": "cfe8bba7-325b-413c-b409-0bfe81bb77a6",
      "post_author": "kb98061",
      "post_author_profile": "https://patient.info/forums/profiles/kb98061-1186836",
      "post_comments": [
        " A hospital doctor told my wife that more than 50% of patients who report with chest are found that it is not of cardiac origin.  Greeting Pain is signal of a problem in your health.pain can be differentiated in many ways.example you may experience headache while the problem is in the stomach.but pain is abnormal.on your side you are young 21yrs.most of the young people experience health problems mostly due to lack of activity and dehydration. I would advise you to exercise atleast 30minutes a day and drinking 8 glasses of clear fluids for 5days.then reply back if any change thank you."
      ],
      "post_content": [
        "<p>hi </p><p></p><p>for the last 3 months i had been having jaw pains and left arm pain. 3 months ago i started having chest pain as well and went to a cardiologist who said my heart is fine and both angina and a heart attack seem unlikely given i&#39;m 21 years old healthy and in good shape. an ecg echocardiogram chest x ray and blood work was done and as regards to the chest pain, it happens after i touch it so i was given anti inflammation pills for that to heal. i&#39;m scared that i might have angina given the hand pain and jaw pain but my chest is healing up. what should i do?</p><p></p><p>to say everything since i&#39;m still a student i was having anxiety because of my thesis and exams but all that anxiety is much better.</p><p></p><p>thanks</p>"
      ],
      "post_follow_count": 3,
      "post_group": [
        "Cardiovascular Disorders"
      ],
      "post_like_count": 0,
      "post_reply_count": 4,
      "post_time": "2018-06-10T15:29:00Z",
      "post_title": [
        "left arm pain and jaw pain"
      ],
      "post_url": [
        "https://patient.info/forums/discuss/left-arm-pain-and-jaw-pain-661994"
      ],
      "symptoms": [
        "Jaw pain",
        "Angina Pectoris",
        "Pain",
        "Chest Pain",
        "Pain in left arm",
        "Hand pain",
        "Headache",
        "Cardiac pain"
      ]
    },
    {
      "_version_": 1760665068481019904,
      "diagnostic_procedures": [
        "Electrocardiography",
        "Pacemaker ECG Assessment",
        "Exercise stress test",
        "Stress Test",
        "Treadmill Test",
        "Diagnosis"
      ],
      "diseases": [
        "Harlequin Fetus",
        "Heparin-induced thrombocytopenia",
        "PARKINSON DISEASE, LATE-ONSET",
        "Syndrome",
        "Adverse Event Associated with Cardiac Arrhythmia",
        "Cardiac Arrhythmia",
        "Conduction disorder of the heart",
        "MICROCEPHALY, EPILEPSY, AND DIABETES SYNDROME",
        "Wiskott-Aldrich Syndrome",
        "Brachial Amyotrophic Diplegia",
        "Premature Cardiac Complex"
      ],
      "id": "70d40c77-4ab2-40bb-9d6c-60bdecfa3ff7",
      "post_author": "paul37731",
      "post_author_profile": "https://patient.info/forums/profiles/paul37731-1070090",
      "post_comments": [
        " I do have permanent atrial fibrillation that mostly I do not notice. One night recently as I was about to go to bed there was a terrific thump in my chest. I almost passed out and fell onto the bed with sweat lashing off me. I would normally associate a thump with ectopic beats. Hi Paul, I think the Doctor  Hi Paul, I think the Doctor  <p>Sounds like symptoms I had. I had heart pause. I had a monitor, they found I had a 3 second pause and a 4 second one.Noticeably, except if it happens while driving, or call and hit your head. I have Sick so us syndrome. So now have a pacemaker.No more pauses, feel better too!!. Definitely, don&#39;t drive till you get to cardio Dr. Good lol I!!</p> <p>Thanks for the response. Nice to get the feedback. </p><p></p><p>My appointment with the consultant is 2 weeks today so not too long to wait. </p><p></p><p>It&#39;s strange the ECG shows nothing adverse. My GP did say however that a monitor might be used to check over a period of time.</p><p></p><p>It&#39;s pretty scary. When the palpitations occur they just take the breath away for a few seconds. Only once have i blacked out and that was the last major attack i had. </p><p></p><p>Thanks again</p> So still waiting for the 24hr monitir but, following the stress treadmill test, the cardiologist diagnosed angina. I will start beta blockers once holter test shows no sudden drop in heart rate. Used GTN spray for 1st time yesterday and chest pain went eithin minutes although very light headed for 30 mins or so. Still get palpitations but hopefully the beta blockers will help. Will be able to drive again in November if beta blockers have no adverse effect. I Harv it happen to me 2 days ago- turning to park the lot of Walmart and everything went black- all I can recall is hearing someone yelling not to move and then getting out as if I was in a nightmare / didn’t know what the heck happened- Again today while taking my daughter to school as I was turning 1/2 of everything went black, Blessed we were because I missed the berm in the middle of the road- Don’t know what it could be- just had blood work all was good- I had at the time no headache or remember my chest pounding however I do see a Neurologist as well as a cardiologist - haven’t taken heart meds for 2 mo that after I lost it and waiting on the pharmacy to contact the Doc- I do recall having pain the day prior in my neck where I had a C5/C6 fusion- and feeling dizzy upon standing- pain and burning down my r arm- I’m petrafide to drive-"
      ],
      "post_content": [
        "<p>i&#39;ve experienced palpitations occasionally over the last few years which last a few seconds and take my breath away. they have never bothered me. yesterday i had been driving for a few minutes when i experienced a large palpitation which really took my breath away and caused me to blackout for a few seconds. fortunately no damage to anyone or the car, just scared the living daylights out of me. my only after effect is a bad headache.</p><p></p><p>today i had ecg which was normal and several blood tests which again showed nothing out of the ordinary. i have been referred to a cardiologist with appointment in 2 weeks. i have been told not to drive until i have seen him.</p><p></p><p>im not sure what caused it but just wondered if anyone else has experienced this type of thing. i cant say at this time if it is cardiac arrhythmia as this is not a regular irregular heat beat! any comments appreciated, thanks.</p>"
      ],
      "post_follow_count": 4,
      "post_group": [
        "Cardiac Arrhythmias"
      ],
      "post_like_count": 0,
      "post_reply_count": 13,
      "post_time": "2017-07-26T20:53:00Z",
      "post_title": [
        "blackout whilst driving"
      ],
      "post_url": [
        "https://patient.info/forums/discuss/blackout-whilst-driving-603142"
      ],
      "symptoms": [
        "Headache",
        "Blackout - symptom",
        "Syncope",
        "Pain",
        "Chest Pain",
        "Illness (finding)",
        "Lightheadedness",
        "Nightmares",
        "Burning sensation",
        "Angina Pectoris"
      ]
    },
    {
      "_version_": 1760665067565613056,
      "diagnostic_procedures": [
        "Diagnosis",
        "Electrocardiography",
        "Diagnostic blood test"
      ],
      "diseases": [
        "Hyperthyroidism",
        "Supraventricular tachycardia",
        "CARDIAC causes",
        "Wiskott-Aldrich Syndrome"
      ],
      "id": "a9238217-8589-4133-b784-3e026d152211",
      "post_author": "timlit2r",
      "post_author_profile": "https://patient.info/forums/profiles/timlit2r-1135572",
      "post_comments": [
        " <p>Unfortunately doctors not being able to diagnose what seems OBVIOUS to the patient is not at all rare in these areas.</p><p>Light-headedness and pain, however, can also come from non-cardiac causes.&#160; I suppose it&#39;s not always easy, being a doctor.</p><p>And they can be quick to call it &quot;anxiety&quot; which means they don&#39;t know, and I doubt Lexapro would be appropriate for any such thing.</p><p></p><p>How is your blood pressure?&#160; Your pulse rate?&#160; Any other diagnostic numbers from blood tests?&#160; Any other current health issues?</p> I think that symptoms are from Lexapro, the chest pain it can be anxiety as the doctor said, specially lexapro can cause headedness , but you don’t have svt, do you? I had all the same symptoms. Turned out it was hyperthyroidism which was causing all the cardiac issues. It also frequently causes an increase in stomach acid because your body speeds up more with it and that causes chest pain. Might be worth getting your thyroid checked out."
      ],
      "post_content": [
        "hello, for the last 5 months i have been getting periods of intense light headedness and chest pain. i was hospitalized for 4 days last month and they put me on a holster monitor for the whole time i was there. they also did an echo several ecg's and an untrasound. everything came back normal. my question is, could an arythmia have been missed? annoyingly i didn't have an episode while i was in hospital as i mostly sat on my butt... i'm a 25 year old male and i'm ready to get my life back. my doctor thinks i have a panic disorder but i don't feel anxious at all and the lexapro he put me on a month ago has done nothing but add headaches to my life.. please help.."
      ],
      "post_follow_count": 4,
      "post_group": [
        "Cardiac Arrhythmias"
      ],
      "post_like_count": 0,
      "post_reply_count": 6,
      "post_time": "2018-05-04T23:14:00Z",
      "post_title": [
        "arythmia ?"
      ],
      "post_url": [
        "https://patient.info/forums/discuss/arythmia--655196"
      ],
      "symptoms": [
        "Chest Pain",
        "Dizziness",
        "Lightheadedness",
        "Pain",
        "Headache"
      ]
    },
    {
      "_version_": 1760665312082001920,
      "diagnostic_procedures": [
        "Diagnosis",
        "Diagnostic lumbar puncture",
        "Magnetic Resonance Imaging",
        "Cardiac Computerized Tomographic Angiography"
      ],
      "diseases": [
        "Migraine Disorders",
        "Refractory migraine",
        "Cyst",
        "Brachial Amyotrophic Diplegia",
        "Heparin-induced thrombocytopenia",
        "Lupus erythematosus tumidus",
        "PARKINSON DISEASE, LATE-ONSET",
        "Hyperostosis, Diffuse Idiopathic Skeletal",
        "Headache Disorders",
        "MICROCEPHALY, EPILEPSY, AND DIABETES SYNDROME",
        "Retention cyst",
        "Daily headache",
        "Disease",
        "Chronic Paroxysmal Hemicrania",
        "Sleep Apnea Syndromes",
        "Harlequin Fetus",
        "Tension Headache",
        "Irritable Bowel Syndrome"
      ],
      "id": "6adc95f3-a56b-45a4-9c30-b03b50b0ff99",
      "post_author": "barberry20",
      "post_author_profile": "https://patient.info/forums/profiles/barberry20-1308670",
      "post_comments": [
        " Hi Barberry. I suppose I'm not being of any help to you replying to your desperate letter as I have not got a clue, but I do sympathise with you as I suffered bad head pain on the top, left and back of my head daily for a few years now which pushes my BP up I suffer with everyday headaches from when I get up in the morning to bedtime. I do sleep because I now take 10mgs of Melatonin by morning my head is hurting again. I can tell my doctor has not a clue and is treating the symptoms and not the cause. He offered me Amitriptyline 10mgs one to five at night. These drugs have been on the market since 1961 and were used as a antidepressant, now used for pain/headaches , they did ease my headaches After 6 months I stopped taking them as I felt brain dead and unresponsive by morning and it took me a long time to wake up. Now trying Diazepam 5mg twice daily. They are addictive and I don't want to take them. I take BP meds and think perhaps they are the cause of my bad heads! I don't have a TV so spend a lot of time on my computer so now I'm trying anti blue light glasses, deep breathing and tapping. Perhaps alternative medicine may help? I do get out walking twice daily in the fresh air, I'm lucky enough to live by the coast. Hope it helps ! I wish you well, take care and stay safe  I had headaches for more than one year. I took many kinds of stress headaches and migraines, too. My headaches was no relief. It took me a years to go many doctors. Now, I was diagnosed with anxiety disorders. I have been taking Duloxetine for almost year and the headaches are gone. It took about 8 months to feel the headaches relief."
      ],
      "post_content": [
        "hello everybody, if this is against the rules, please let me know. i am here seeking advice about my headaches. i am here out of desperation. i'm not necessarily seeking a diagnosis for my issue but rather advice on where to go next, what questions to ask my physicians, etc. i am a 25-year-old male. i weigh 185 pounds. i have diagnoses of ibs with constipation, generalized anxiety disorder, and i am currently being evaluated by a sleep specialist for possible sleep apnea. i have dealt with headaches my entire life. my first mri for headaches was after an accident in gymnastics where i hit my head in 2005. i had a ct in the er, where they noticed a shadow, so the radiologist recommended an mri. during this mri, they noticed what they believed was a neuroepithelial cyst. this cyst is still present today and is slightly larger than it was previously. fast forward to high school, i had another mri due to recurrent headaches. during this time, bilateral maxillary sinus retention cysts were noted. i was treated for allergies with nasal steroids and these headaches went away. fast forward to june, 2019. i started a new job where i had to park quite a way from my workspace. after arriving at work each day, i noticed i had a headache that would go away with a few minutes of inactivity and by cooling down. eventually, however, these headaches became harder to abort. i ended up in the er four times before i was hospitalized the first time, for what the neurologist called an intractable migraine. during my er visits, i was given multiple doses of toradol which provided no relief. i was also given fioricet and given a lumbar puncture, which showed an elevated opening pressure of 29. i was started on diamox by my er physician for suspected iih. during my first hospitalization, my neurologists claimed my er physician performed the lp incorrectly, as it is not likely for a male of normal weight to have elevated pressure or to have iih. the lp was never repeated during this stay. i was diagnosed with an intractable migraine due to my symptoms: a headache that caused the worse pain of my entire life, balance issues making it hard to walk, slurred speech, and double vision. i had no light or sound sensitivity. i was treated with the valproic acid/dhe protocol, and i was discharged in the same condition that i was admitted in. during this stay, i had a cta/ctv of the head/neck, an mri with/without contrast of the head/neck/face. everything was normal except for the cyst, which everybody agreed was benign. i requested a second opinion and saw a neurologist at home. this neurologist agreed with the er doctor and gave me a suspected diagnosis of iih and increased my diamox to 1,500mg/day. a repeat lp was ordered. about 2 months later, i had the repeat lp and had a normal opening pressure of 16. the neurologist said the diamox was working and that was good. due to my headaches worsening, the neurologist also started me on depakote. i noticed no improvement with my symptoms. i sought a 3rd opinion at the biggest hospital in my state with their headache specialist. he basically said the er doctor and my last neurologist were wrong and diagnosed me with a migraine disorder. he continued the depakote and prescribed aimovig. two weeks later, i was hospitalized with a near inability to walk due to my headaches and dizziness. they continued the dhe/valproic acid protocol which provided no relief. i was also given an occipital nerve block just in case. after a few days, i had a new attending neurologist. he didn't believe i had any symptoms of a migraine and started me on indomethacin, titrating me up to 250mg/day. this medication relieved my symptoms almost immediately, and i was diagnosed with with an indomethacin-responsive headache syndrome, chronic paroxysmal hemicrania. i was also diagnosed with primary exercise headaches. however, i still experience headaches on a daily basis. if i take less than 200mg/day of indomethacin, i have debilitating headaches that nearly justify hospitalization. my headaches are worsened by any amount of exertion. even doing dishes and sweeping my floors will trigger an immense headache. is there something my neurologists could be missing? is there another medication i should ask about? what can treat the exertion aspect of the headaches? i will include a list of medications i am currently on, as well as a list of things i have tried for the headaches and their effectiveness. currently taking: prazosin - 4mg/day for headaches venlafaxine - 75mg/day for headaches/anxiety doxepin - 10mg/day for sleep issues indomethacin - 200mg/day for headaches acetaminophen - 2,000 to 4,000mg/day for headaches miralax for constipation medications i have tried for headaches depakote - no relief aimovig - six months so far and no relief sumatriptan - oral and injections - no relief and negative cardiac symptoms nasal and im dihydroergotamine - no relief and based on recommendation of cardiologist in er, i should not take again due to negative cardiac symptoms topiramate - no relief propranolol - no relief and negative side effects amitriptyline - no relief and negative side effects duloxetine - no relief"
      ],
      "post_follow_count": 4,
      "post_group": [
        "Headache"
      ],
      "post_like_count": 2,
      "post_reply_count": 2,
      "post_time": "2020-04-22T01:29:00Z",
      "post_title": [
        "complicated headaches - long post"
      ],
      "post_url": [
        "https://patient.info/forums/discuss/complicated-headaches-long-post-734335"
      ],
      "symptoms": [
        "Headache",
        "Pain",
        "cardiac symptom",
        "Constipation",
        "Breathing abnormally deep",
        "Dizziness",
        "Vertigo",
        "Headache recurrent"
      ]
    },
    {
      "_version_": 1760665114528186368,
      "diagnostic_procedures": [
        "Axillary Reverse Mapping",
        "Echocardiography"
      ],
      "diseases": [
        "Myocardial Infarction",
        "Cardiac Arrest",
        "Migraine Disorders",
        "Harlequin Fetus",
        "Lupus erythematosus tumidus"
      ],
      "id": "f6a1e0ea-da55-4773-903c-f3b46699853a",
      "post_author": "Anxeysquesh8176",
      "post_author_profile": "https://patient.info/forums/profiles/anxeysquesh8176-1263714",
      "post_comments": [
        " Hey, why won't your parents take you to the doctors? have you told them about everything your feeling? Do you have another adult who could take you instead just for your peace of mind. It sounds like anxiety and only being 17 years old wouldn't be a heart attack or anything like that. hopefully you can find an adult to take you to the doctors or being 17 could you just go by yourself? Sorry I'm not much help. hoping everything settles down for your soon! Cassandra  HI! i'm 17 too and i just want you to know that youre not alone. i am glad as well that im not alone experiencing this things. usually when i visit this site it's a lot of older people... anyways, i know how you feel whenever a headache is happening i feel like im gonna have an aneurysm and die. unfortunately i have death anxiety so im scared of both things. i also have chest pains and sometimes i have stomach pain but ive read somewhere thats its just the anxiety and i just keep reminding myself that. My faith in God has helped me a lot and i havent gone to the doctor about my mental health its usually just me searhcing through the internet. i wish we could talk do you have any social media? lol Sounds like anxiety, as those are all symptoms. At 17 it is unheard of to have angina, and cardiac problems are only possible if you have a genetic defect, which an echocardiogram can detect. I would go to the doctors to be sure if possible."
      ],
      "post_content": [
        "im kind of just ....done with all of these crazy and scary symptoms i keep having which are supposedly supposed to be my anxiety....but no matter what my mind wont take anxiety as an answer....for about five months now...my symptoms have only gotten worse...i cant see a doctor my parents wont let me and im getting actually angry , annnoyed , scared and just straight up depressed about all of this and my mental health, anyways a newer few symptoms have been getting to me as of this week...which is the horrifying chest pains...and these are stuttering type of chest pains , which come on at random as more of aches , squeezy like pains they last a couple of seconds then go away, im 17 having a fear of heart attack or cardiac arrest, angina all of it, my back aches my neck hurts sometimes, i keep having random migraines and ice picks , sometimes i get arm and jaw pains or pain above or around my eye at random which by the way has me scared of an aneurysm too but im really scared about my chest pains... please somebody help me im on the verge of just breaking down, its like i get every symptom of heart attack or aneurysm or something!! its always something!! and i don't know what to do anymore!!"
      ],
      "post_follow_count": 5,
      "post_group": [
        "Anxiety Disorders"
      ],
      "post_like_count": 0,
      "post_reply_count": 3,
      "post_time": "2019-08-28T05:46:00Z",
      "post_title": [
        "anxiety or heart issue?? rlly confused and scared"
      ],
      "post_url": [
        "https://patient.info/forums/discuss/anxiety-or-heart-issue-rlly-confused-and-scared-711994"
      ],
      "symptoms": [
        "Chest Pain",
        "Angina Pectoris",
        "Pain",
        "Back Pain",
        "Jaw pain",
        "Cardiovascular symptoms",
        "Ache",
        "Abdominal Pain",
        "Death anxiety",
        "Stomach ache",
        "Mastodynia",
        "Headache"
      ]
    },
    {
      "_version_": 1760665272223531008,
      "diagnostic_procedures": [
        "Diagnosis",
        "Cardiac monitoring",
        "Electrocardiogram",
        "Electrocardiography",
        "tests and testing",
        "Echocardiography, Stress"
      ],
      "diseases": [
        "Gastroesophageal reflux disease",
        "Bleeding ulcer",
        "Migraine Disorders",
        "Tietze's Syndrome",
        "Esophagitis",
        "Gastritis",
        "Brachial Amyotrophic Diplegia"
      ],
      "id": "372c1a62-4e64-44dd-878c-47ad8ed5d40b",
      "post_author": "stacia96721",
      "post_author_profile": "https://patient.info/forums/profiles/stacia96721-1302201",
      "post_comments": [
        " I think the reassuring thing is that so far cardiac wise it's all clear and you have had a diagnosis that would explain the burning sensations. I think alongside your ulcer you may have a bad case of Esophagitis. What ever antacids/proton pumps they gave you should help with it. My dad has a history of a lot of ulcers and he had the same symptoms as your describing. Do you have a family history of heart problems, are you healthy? (eat well and exercise, not overweight) it's really great you had the 48 hour tests that's a very useful test it's unlikely you have any long lasting arythmia if that was clear. Maybe ask for an echo to look at the structure of the heart or a stress echo. Just want to say If you ever feel like your heart is racing, sit down and relax for a bit and sip water and deep breaths. It can help even if it's not anxiety triggered. If a fast heart rate bothers you ask your GP about beta blockers, there also used of label for anxiety and migraines. They can disuse if they think it's suitable for you. I really don't think it's cardiac but I'm not a doctor, so don't stop with my advice. Keep going to your GP and if it gets severe please go to the hospital. Take care of yourself and don't be afraid to ask questions.  Some of the burning could be GERD. I am 54 and have had similar issues and mine is GERD. I know how frustrating this process is since I continue to have cardiac workups each time I have symptoms. Its always a relief that its not cardiac, However, I have been told by my cardiologist that I will need to be checked every time since I can never tell fir sure if it us my GERD, Costochondritis, or other connective tissue problems. "
      ],
      "post_content": [
        "so i am 48 years old and went to the er 2 months ago diagnosed with gastritis an bleeding ulcers and anxiety. also did a full cardiac blood panel ekg and 48 hour heart monitor...all normal. i have had burning in my chest and throat and shoulder and a mild headache.any thoughts on if this could be cardiac related even if things came back normal just a couple months ago"
      ],
      "post_follow_count": 3,
      "post_group": [
        "Chest Pain"
      ],
      "post_like_count": 0,
      "post_reply_count": 2,
      "post_time": "2020-03-20T04:56:00Z",
      "post_title": [
        "burning left side of chest"
      ],
      "post_url": [
        "https://patient.info/forums/discuss/burning-left-side-of-chest-731303"
      ],
      "symptoms": [
        "Burning sensation",
        "Headache",
        "HEART PROBLEM",
        "chest burning",
        "Breathing abnormally deep"
      ]
    },
    {
      "_version_": 1760665189399658496,
      "diagnostic_procedures": [
        "Diagnosis"
      ],
      "diseases": [
        "Cardiac Arrest",
        "Cerebrovascular accident",
        "Myocardial Infarction",
        "Hypertensive disease",
        "Brachial Amyotrophic Diplegia",
        "cardiac event",
        "Premature ventricular contractions"
      ],
      "id": "c1570dc5-c3ee-453a-89a7-ed347fefa850",
      "post_author": "david05967",
      "post_author_profile": "https://patient.info/forums/profiles/david05967-1015116",
      "post_comments": [
        " <p>You have been taking 2 Beta blockers for 17 years and now docs told you that you have a bradycardia?</p><p></p><p>If so, maybe docs switched from 2 BBs to only 1, to slightly raise your heart rate.</p><p>On the other hand, they don&#39;t want to leave you without BBs since you had a cardiac arrest.</p><p></p><p>In those cases, docs usually give BBs, and more or less, you will need to take them forever.</p><p></p><p>So, maybe in your case this is a story about two evils.</p><p>Cardiac arrest was very dangerous, and bradycardia is dangerous, but less.</p><p></p><p>Since the drugs to prevent another cardiac arrest will always cause bradycardia, docs picked a lesser evil.</p><p></p><p>About Bisoprolol and bradycardia, Biso will slow down your heart rate, prevent arrhymtias, lower a blood pressure and give protection against other cradiac events.</p><p></p><p>If you will ask to quit Biso, you will probably get some other BB (Metoprolol, Atenolol, Nebivolol, Propranolol, Carvedilol etc) since you probably need to take them as a prevention against new cardiac events, which you sadly, already experienced.</p><p></p><p>If you want to quit all BBs, you will experience a problem since you won&#39;t have a protection anymore, which you had for 17 years.</p><p>Plus, if you have been taking 2 BBs for 17 years, if you quit both of them, you will probably experience extremely hard and long withdrawal.</p><p>And since you already had cardiac arrest, a hard withdrawal could easily (my opinion) cause lots of dangerous arrhytmias, angina, rebound too high blood pressure and heart attacks.</p><p></p><p>If you&#39;ll want to quit both BBs (and now Bisoprolol), please consider those withdrawal problems also.</p> <p>I&#39;m so happy to say that following a conversation with the hospital pharmacist I have been taken off Bisoprolol and back on Atenolol which I have been on for 15 years without any problems. The side effects of Bisoprolol were ruining my life. I know only two percent of patients suffer but I had three of the worst side affects.</p>"
      ],
      "post_content": [
        "<p>i was diagnosed on tuesday night with bradycardia with episodes of ventricular ectopics. i was taken off the two bb&#39;s i have been taking for 17 odd years since i had a stroke and cardiac arrest and prescribed 1.25mg bisoprolol instead. the palpitations are bad enough but the side effects are worse. cold feet, dry mouth &amp; throat, persistant tiredness, headache, flatulence and heartburn. i&#39;ve only had 3 doses and i am worried that the side effects will get worse as the dose builds up inside me? i&#39;m also concerned that i haven&#39;t seen any other reference to bisoprolol being prescribed for bradycardia? anyone else have any experience?</p>"
      ],
      "post_follow_count": 9,
      "post_group": [
        "Bisoprolol"
      ],
      "post_like_count": 0,
      "post_reply_count": 23,
      "post_time": "2017-01-27T22:42:00Z",
      "post_title": [
        "worsening side effects on bisoprolol"
      ],
      "post_url": [
        "https://patient.info/forums/discuss/worsening-side-effects-on-bisoprolol-561498"
      ],
      "symptoms": [
        "Angina Pectoris",
        "Flatulence",
        "Headache",
        "Fatigue",
        "Heartburn"
      ]
    },
    {
      "_version_": 1760665015839358976,
      "diagnostic_procedures": [
        "MRI Scans",
        "Magnetic Resonance Imaging",
        "Plain x-ray"
      ],
      "diseases": [
        "Common Cold",
        "Upper Respiratory Infections",
        "Virus Diseases",
        "Harlequin Fetus",
        "Influenza"
      ],
      "id": "71a23ba1-80a9-43f3-b6f7-c870723abbc2",
      "post_author": "swckv",
      "post_author_profile": "https://patient.info/forums/profiles/swckv-914162",
      "post_comments": [
        " If the doctors can find nothing physical wrong with you, a lot of those symptoms could be anxiety, perhaps related to the situation involving the HIV scare. Could the cough & sputum be from smoking or exposure to some other airborne pollution or maybe you just have a cold? I'm assuming you're in the northern hempisphere where it would be cold and flu season right now. Hi swckv The only thing I can suggest is to see if they will give you a MRI scan. This will show once and for all if there is anything wrong. Kev (UK) :))"
      ],
      "post_content": [
        "after my mistake (hiv scare) i have all these symptoms: heart wall pain, chest wall pain, radiating pain to the whole body, and headache, and cough and sputum. i x-rayed 6 times in 6 months and doctors can not see what is wrong with me. do i have a virus going inside my body? a viral infection? if i did sputum culture test and it keep failing, is there another test i can do to find out if i have infections?"
      ],
      "post_follow_count": 4,
      "post_group": [
        "Chronic Obstructive Pulmonary Disease"
      ],
      "post_like_count": 0,
      "post_reply_count": 28,
      "post_time": "2016-02-04T19:00:00Z",
      "post_title": [
        "viral infection to the lungs and brain?"
      ],
      "post_url": [
        "https://patient.info/forums/discuss/viral-infection-to-the-lungs-and-brain--496522"
      ],
      "symptoms": [
        "Chest wall pain",
        "Coughing",
        "Headache",
        "Cardiac pain",
        "Total body pain syndrome",
        "Pain"
      ]
    },
    {
      "_version_": 1760665332434862080,
      "diagnostic_procedures": [
        "X-Ray Computed Tomography",
        "Axillary Reverse Mapping",
        "Cardiac Computerized Tomographic Angiography"
      ],
      "diseases": [
        "Cerebrovascular accident"
      ],
      "id": "5b506691-149e-4509-8ff5-e986fc1a5d68",
      "post_author": "rowan75746",
      "post_author_profile": "https://patient.info/forums/profiles/rowan75746-943876",
      "post_comments": [
        " Maybe u need a chiropractor do the headaches come and go or r they do constant  Ifi wereyou, I'd go to (depending on where you are in the world) A&E/ER. Cutting out themiddle man would be safest I think. I had a brain bleed, obviously they're serious, take no chances. Good luck. A person can cause a bulging disc by rolling over weirdly in bed! I would get a ct scan. Does it help to put one of your arms, lower arm resting on top of your head, up in that position? Everyone I know that has had surgery on a neck disc instinctively got in that position to alleviate the pain (for a few minutes!), including me. Doubt it is a bleed because it would be such a severe headache you wouldn't have been able to post your concern. Still, I would try to see if you might have a impinged nerve causing your headaches."
      ],
      "post_content": [
        "already seen a doctor and been given muscle relaxants for my neck. i'm male 43, normal blood pressure, no smoking, some drinking, some family stroke history. the reason i saw the doctor is that for about a week i've had an unusual headache in back of head (i never get headaches) accompanied by neck stiffness that comes and goes (sometimes severe on tilting back, hurts after a certain angle when turning side to side). no other symptoms, no nausea etc. my concern is whether this could be a missed warning sign for a brain bleed. should i insist on a ct/cta scan? i'm planning to be on a fairly remote beach in three weeks and it would be hard to get urgent medical care quickly if anything happened. thanks for any insights!"
      ],
      "post_follow_count": 4,
      "post_group": [
        "Headache"
      ],
      "post_like_count": 1,
      "post_reply_count": 3,
      "post_time": "2016-05-21T04:58:00Z",
      "post_title": [
        "headache, neck stiffness, should i insist on a ct scan?"
      ],
      "post_url": [
        "https://patient.info/forums/discuss/headache-neck-stiffness-should-i-insist-on-a-ct-scan--513908"
      ],
      "symptoms": [
        "Headache",
        "Neck stiffness",
        "Pain",
        "headache severe",
        "Nausea"
      ]
    },
    {
      "_version_": 1760665323514626048,
      "diagnostic_procedures": [
        "Magnetic Resonance Imaging",
        "Radionuclide Imaging",
        "Scanning",
        "X-Ray Computed Tomography",
        "Plain Radiography of Chest",
        "Plain chest X-ray",
        "Cardiac Computerized Tomographic Angiography"
      ],
      "diseases": [
        "Lupus erythematosus tumidus"
      ],
      "id": "9e8d008d-ee0c-400e-82be-f8aec2431a35",
      "post_author": "carly63536",
      "post_author_profile": "https://patient.info/forums/profiles/carly63536-1168544",
      "post_comments": [
        "  your worries are heard trust me, i too have head head pressure for the last seven months of constant pain as if my head is swollen or something - an annoying and distracting feeling, i have been down many roads, i have 3 brains scans CT/CTA and MRI, all coming back clear - all sorts of blood tests, x rays of chest and stomach and still everything appears to be normal. I will not let get this to rule my life and will fight it until i get back to who i was before all this. Today i have been referred for a full spinal mri, this should hopefully help in finding some answers. Hope you do one day and find relief. "
      ],
      "post_content": [
        "i feel so hopeless right now! so for the past 2 years now i have been dealing with this constant head pressure in my head it almost feels like my brain is rotting away it is severe head pain that never goes away my family tell me i'm making it up and i'm crazy i just can't live normal, i find it difficult to concentrate and my cognitive functions are basically nonexistent, i have been to the hospital and had ct scans and mri which came back normal with the exception of a pineal cyst found on the scan which i was told not to worry about, if anybody else is experiencing these symtoms it would be a great help"
      ],
      "post_follow_count": 2,
      "post_group": [
        "Headache"
      ],
      "post_like_count": 0,
      "post_reply_count": 1,
      "post_time": "2018-04-05T08:38:00Z",
      "post_title": [
        "headache is my head rotting away?"
      ],
      "post_url": [
        "https://patient.info/forums/discuss/headache-is-my-head-rotting-away--649018"
      ],
      "symptoms": [
        "head pressure",
        "Headache",
        "headache severe",
        "Signs and Symptoms"
      ]
    },
    {
      "_version_": 1760665069546373121,
      "id": "6614c05e-6a4a-4b91-858a-0dea781eb4b9",
      "post_author": "sara78091",
      "post_author_profile": "https://patient.info/forums/profiles/sara78091-1155876",
      "post_comments": [
        " <p>As you can see from my previous posts, I am no fan of this drug. &#160;It works but the side effects are downright awful. &#160;I was on it for 6 months while awaiting a double ablation for my A-Fib and it nearly killed me. &#160;You can check my posts for the side effects I experienced. &#160;They grew worse by the week until I reached the point where I could hardly get out of bed. &#160;I had the ablations in December and have been off Amiodarone since January 9. &#160;It takes two months to get out of one&#39;s system. &#160;I am just starting to feel human again. &#160;Sotolol is a kinder A-Fib drug but is not quite as effective. &#160;Good luck!</p>"
      ],
      "post_content": [
        "recently i got a really high dose of amiodarone for 24 hours during a vacation in thalland where i got arytmia - even now two weeks a after - i have pain in my arm, i am assuming from the iv, headache, dizziness etc.. anyone who has experience with this - i am off the medication now but have not found any information on one time use."
      ],
      "post_follow_count": 2,
      "post_group": [
        "Cardiac Arrhythmias"
      ],
      "post_like_count": 0,
      "post_reply_count": 1,
      "post_time": "2018-03-01T08:32:00Z",
      "post_title": [
        "one time dose amiodarone and side effects"
      ],
      "post_url": [
        "https://patient.info/forums/discuss/one-time-dose-amiodarone-and-side-effects-641147"
      ],
      "symptoms": [
        "Headache",
        "Arm Pain",
        "Dizziness",
        "Vertigo"
      ]
    },
    {
      "_version_": 1760665162483761152,
      "diagnostic_procedures": [
        "Holter Electrocardiography",
        "Diagnosis",
        "Pacemaker ECG Assessment",
        "Heart Health Tests",
        "MG",
        "Mammography"
      ],
      "diseases": [
        "Cardiac Arrhythmia",
        "Atrial Fibrillation",
        "MICROCEPHALY, EPILEPSY, AND DIABETES SYNDROME",
        "Cardiac Arrest"
      ],
      "id": "df777df3-5c4a-4957-908e-ddf2b8b779c8",
      "post_author": "denny87275",
      "post_author_profile": "https://patient.info/forums/profiles/denny87275-1002295",
      "post_comments": [
        " <p>Well, not exactly considered an advice, but I personally suffer health anxiety - cardiophobia. Experienced sudden fast and strong heart beat, it could have been AFib, but my heart tests were all fine and still i suffer from and recently i experience skipped or extra beat (same) frequently though my heart is fine. I am sure that it is caused by anxiety. Tomorrow i will buy &quot;magnesium&quot; supplement which i heard from people that it fixed their &quot;skipped beats&quot;.</p> my heart has been skipping for decades. I take Inderal LA 180 mg, a beta blocker. <p>I am 21 and got diagnosed with bradycardia too. According to </p><p>my holter monitor, my resting heartbeat is around 34. Anyways, I have heart arrhythmia too and that does not help anything at all. My doctor said that the arrhythmia was fine and it wouldn&#39;t hurt </p><p>anything. 2 weeks later I am in the back of an ambulance with </p><p>cardiac arrest. Cardiologists think that it might be because of the skipped beats and slow heart rate combined... </p> <p>Thanks for the reply - Permanent headaches from all the meds now....they say the headaches will subside....haven&#39;t...seeing Cardiologist again today...probably for&#160;more tabs....keeping the drugs industry in&#160;business but at least I&#39;m still here...Best Wishes, keep well.</p>"
      ],
      "post_content": [
        "all started in 2003 when i passed out and was diagnosed with a very slow heartbeat. my heart had a completely closed artery but had done its own bypass so the blood flow was good. i was implanted with a pacemaker and am now on my second battery life. started feeling skipped beats and the pacemaker acting almost like a holter monitor pick them up and they said they were not the dangerous type. they occur mostly when i am inactive and are occupied with pain on my left side from my neck down to my stomach. i feel very inflamed. my breathing is fine but i do get anxiety because of these skipped beats. has anybody had this type of experience and what advise would you give me on my next step. thanks ."
      ],
      "post_follow_count": 6,
      "post_group": [
        "Cardiovascular Disorders"
      ],
      "post_like_count": 0,
      "post_reply_count": 9,
      "post_time": "2016-12-16T15:06:00Z",
      "post_title": [
        "skipped heartbeats"
      ],
      "post_url": [
        "https://patient.info/forums/discuss/skipped-heartbeats-553328"
      ],
      "symptoms": [
        "Headache",
        "Pain"
      ]
    },
    {
      "_version_": 1760665195473010688,
      "diagnostic_procedures": [
        "A1C -- test",
        "Electroencephalography",
        "Palpation",
        "Plain chest X-ray",
        "CT scan of chest",
        "Chest CT",
        "CAT scan of head",
        "Cardiac monitoring",
        "Electrocardiogram",
        "Electrocardiography",
        "MRI of head",
        "Cardiac Computerized Tomographic Angiography"
      ],
      "diseases": [
        "Harlequin Fetus"
      ],
      "id": "e8adaedc-14bc-4132-a2ed-0ab925e93dde",
      "post_author": "devon10898",
      "post_author_profile": "https://patient.info/forums/profiles/devon10898-1137843",
      "post_comments": [
        " Hi Devon. Sounds to me like you have everything covered try a good foot spa if nothing else it will help you relax xx"
      ],
      "post_content": [
        "i'm a 27 going on 28 year old caucasian male 6'2\" 294 pounds (down from 315, making slow but steady progress) since july of 2017 i've been dealing with dizziness, balance issues (often feels like i'm swaying) faint feeling and weakness, chest pain both sides but more frequently over the heart and under the left side breast, palpations, fast heart rate, extreme shortness of breath, and headaches. i've seen my primary care doctor, neurologist, cardiologist, and my eye doctor. i've had a comprehensive and basic metabolic panel, full cbc, lipid panel, a1c, t4 and tsh, vitamin 25- d, b12, magnesium, urine culture and analysis. i've also had multiple ekg, chest x-ray, ct scan of my chest, ct of my head with and without contrast, an mri of my head, a cta of my neck and head, an eeg, and echo of my heart, a 7 day heart monitor, a month and half of daily blood pressure readings and the only abnormal thing was my b12 came back at 990 pg/ml. every other test has come back completely normal and yet i feel sick as ever - i am now having daily occurrences of dizziness, imbalance, headaches, shortness of breath ... etc are my doctors missing something? i'm at a complete loss and it seems so are they. any advice or direction would be so appreciated."
      ],
      "post_follow_count": 2,
      "post_group": [
        "Vertigo and Dizziness"
      ],
      "post_like_count": 1,
      "post_reply_count": 2,
      "post_time": "2018-01-08T04:09:00Z",
      "post_title": [
        "at a loss, could really use some direction."
      ],
      "post_url": [
        "https://patient.info/forums/discuss/at-a-loss-could-really-use-some-direction--630528"
      ],
      "symptoms": [
        "Headache",
        "Dyspnea",
        "Dizziness",
        "Vertigo",
        "Chest Pain",
        "Illness (finding)",
        "Imbalance",
        "Weakness",
        "Syncope"
      ]
    },
    {
      "_version_": 1760665066289496064,
      "diseases": [
        "Premature Cardiac Complex",
        "Cardiac Arrhythmia"
      ],
      "id": "45b2e3c4-20d5-4c23-8988-4fda8e72e33a",
      "post_author": "Caterina26101",
      "post_author_profile": "https://patient.info/forums/profiles/caterina26101-675319",
      "post_comments": [
        " Any stress can increase arrhythmias. Talk to your doctors, of course. If you haven't tried it before a small dose of beta blocker (say atenolol) may help."
      ],
      "post_content": [
        "today is day 5 of my sinus surgery and all i can say is i still feel horrible! but what adds to the dizziness, dry sore mouth, nose dripping, no energy, headaches no sleep is my ectopics have gone crazy with a really fast heart rate around 98 all day, i feel my heart going to jump out of my chest! i try to stay calm and not cry because that makes things worse. i am wondering if it is the antibiotics that i am taking? i stopped my zantac while on these antibiotics as i could not handle both. on top of this is the fact that the ulvula is still swollen and making me gag!!. some advice from someone who has experienced any thing like this would be appreciated thanks."
      ],
      "post_follow_count": 2,
      "post_group": [
        "Cardiac Arrhythmias"
      ],
      "post_like_count": 0,
      "post_reply_count": 1,
      "post_time": "2019-09-05T22:24:00Z",
      "post_title": [
        "ectopics and sinus surgery hell!!"
      ],
      "post_url": [
        "https://patient.info/forums/discuss/ectopics-and-sinus-surgery-hell--712878"
      ],
      "symptoms": [
        "Headache",
        "Sore mouth",
        "Sore skin",
        "Sore to touch",
        "Dizziness",
        "Vertigo"
      ]
    },
    {
      "_version_": 1760665066372333568,
      "diagnostic_procedures": [
        "Cardiac monitoring"
      ],
      "diseases": [
        "Brachial Amyotrophic Diplegia",
        "Hypertensive disease"
      ],
      "id": "0d94d1d0-8416-459e-a785-ad3273e0e32b",
      "post_author": "nicola39217",
      "post_author_profile": "https://patient.info/forums/profiles/nicola39217-960637",
      "post_comments": [
        " Where in the world are you?? I’m in the uk . I tried ane Friday and Monday cause I felt awful they all just Said have to go gp and be monitored. I’m off for a emergency appointment tonight but it seems Iv been goin back and forth Iv had loads of blood all fine and then they just stop there after the blood come normal  <p>Nicola, is there any other doctor that you can go to? Are you telling the people at the hospital that say you have no appointment what your symptoms actually are?</p><p></p><p>If you are, I can&#39;t imagine that they wouldn&#39;t see you! The systolic pressure of 153 isn&#39;t good, but is less worrisome than the diastolic pressure of 101. Having just one number high like that can cause issues.</p><p></p><p>All the symptoms you give such as the dizzying headache, visual disturbances, exhaustion, chest pain, and palpitations&#160;<i>could&#160;</i>be warning sides of something else. It&#39;s crazy for doctors to be ignoring it if they know. You need to find another doctor that [b]will [/b]see you.&#160;</p>"
      ],
      "post_content": [
        "i been feeling poorly for a while and the doctors are goin very slow in my treatmencause long waiting times for appointment feeling awful dizzy headache visual disturbances exhaustion like iv never felt . i have hbp and my heart rate never drop under 110 goes up to 150 when i'm bad my bp is 153/101 i went ane with chest pain and palpitations to doctor at hospital said have to see gp for heart monitor but they won't see me keep sayin have no appointment. what could be up i get chronic migrianes to i'm 24 female lookin for advice"
      ],
      "post_follow_count": 3,
      "post_group": [
        "Hypertension"
      ],
      "post_like_count": 0,
      "post_reply_count": 4,
      "post_time": "2018-03-23T12:26:00Z",
      "post_title": [
        "high blood pressure and tachycardic"
      ],
      "post_url": [
        "https://patient.info/forums/discuss/high-blood-pressure-and-tachycardic-646093"
      ],
      "symptoms": [
        "Exhaustion",
        "Chest Pain",
        "Dizziness",
        "Headache"
      ]
    },
    {
      "_version_": 1760665352113487872,
      "diseases": [
        "Adverse Event Associated with Cardiac Arrhythmia",
        "Cardiac Arrhythmia",
        "Conduction disorder of the heart",
        "Paresthesia",
        "Tinnitus"
      ],
      "id": "f8ff3c32-ab31-4a0b-be59-d4fcdbcc6346",
      "post_author": "nicky39064",
      "post_author_profile": "https://patient.info/forums/profiles/nicky39064-1142119",
      "post_comments": [
        " <p>Honestly it&#39;s nothing to worry about!</p><p>The serotonin levels are presumably trying to find the sweet spot so you&#39;ll be a bit unbalanced for a bit. Hopefully it will subside and you will see results soon :)</p> <p>As I said before once your body gets used to them you&#39;ll be fine. You seriously need to read up on this stuff.</p><p></p><p>Adverse effects</p><p>Sexual dysfunction is often a side effect with SSRIs. Specifically, common side effects include difficulty becoming aroused, lack of interest in sex, and anorgasmia (trouble achieving orgasm). One study showed, however, when remission of major depressive disorder is achieved, quality of life and sexual satisfaction is reported to be higher in spite of sexual side effects.</p><p></p><p>Citalopram theoretically causes side effects by increasing the concentration of serotonin in other parts of the body (e.g., the intestines). Other side effects, such as increased apathy and emotional flattening, may be caused by the decrease in dopamine release associated with increased serotonin. Citalopram is also a mild antihistamine, which may be responsible for some of its sedating properties.:104</p><p></p><p>Common side effects of citalopram include drowsiness, insomnia, nausea, weight changes (usually weight gain), increase in appetite, vivid dreaming, frequent urination, decreased sex drive, anorgasmia, dry mouth, increased sweating, trembling, diarrhea, excessive yawning, severe tinnitus, and fatigue. Less common side effects include bruxism, vomiting, cardiac arrhythmia, blood pressure changes, dilated pupils, anxiety, mood swings, headache, and dizziness. Rare side effects include convulsions, hallucinations, severe allergic reactions and photosensitivity. If sedation occurs, the dose may be taken at bedtime rather than in the morning. Some data suggest citalopram may cause nightmares.</p><p></p><p>Withdrawal symptoms can occur when this medicine is suddenly stopped, such as paraesthesiae, sleeping problems (difficulty sleeping and intense dreams), feeling dizzy, agitated or anxious, nausea, vomiting, tremors, confusion, sweating, headache, diarrhea, palpitations, changes in emotions, irritability, and eye or eyesight problems. Treatment with citalopram should be reduced gradually when treatment is finished.</p><p></p><p>Citalopram and other SSRIs can induce a mixed state, especially in those with undiagnosed bipolar disorder.</p>"
      ],
      "post_content": [
        "okay so some of you may know day 5-7 on citalopram i couldn't shake the word cancer out of my head. now today i seem to look at people and think hate towards them. i don't personally hate them even the people i like. is this normal and will it subside? x"
      ],
      "post_follow_count": 5,
      "post_group": [
        "Citalopram"
      ],
      "post_like_count": 0,
      "post_reply_count": 8,
      "post_time": "2018-01-22T17:44:00Z",
      "post_title": [
        "day 8 on citalopram"
      ],
      "post_url": [
        "https://patient.info/forums/discuss/day-8-on-citalopram-633330"
      ],
      "symptoms": [
        "Diarrhea",
        "Headache",
        "Tremor",
        "Vomiting",
        "Nausea",
        "Dizziness",
        "Agitation",
        "Convulsions",
        "Difficulty sleeping",
        "Mydriasis",
        "Nightmares",
        "Perceived quality of life",
        "Seizures",
        "Sleep disturbances",
        "Sleeplessness",
        "Trembling",
        "Withdrawal Symptoms",
        "Vertigo",
        "Fatigue"
      ]
    },
    {
      "_version_": 1760665317462245376,
      "diagnostic_procedures": [
        "Radionuclide Imaging",
        "Scanning",
        "Electrocardiography",
        "Plain chest X-ray",
        "X-Ray Computed Tomography"
      ],
      "diseases": [
        "Cardiac Arrhythmia",
        "Hypertensive disease",
        "Brachial Amyotrophic Diplegia",
        "Harlequin Fetus",
        "Dehydration",
        "Wiskott-Aldrich Syndrome",
        "Primary Thunderclap Headache"
      ],
      "id": "92a8c396-4ed0-4885-bcf9-3d5699009790",
      "post_author": "sheralynne",
      "post_author_profile": "https://patient.info/forums/profiles/sheralynne-1221754",
      "post_content": [
        "hi there, new to this forum and looking for a bit of advice or anyone with similar experience. my mum is 59 years old and last friday she had a lumpectomy for breast cancer in her left side. the surgery went well and are awaiting results in the post op next week. today, she had an upset stomach all morning. when she came back downstairs on the last occasion, she looked grey and said her head was so painful, it was throbbing. my mum has a very high pain thresholds and never complains. it got so bad that we called an ambulance as she also started getting palpitations (she also has high blood pressure for which she is taking medication daily). because the pain started from the back of her head and went up to the top, radiating all over, they suspected a bleed on the brain. at the hospital they did a ct scan, chest x-ray, 2 blood tests and gave her a saline drip. all scan results came back clear and no bleeds. the blood came back with deranged liver.... something, can't remember, but was told just to repeat blood test next week at doctors, and her ecg showed a few irregular heartbeat but they weren't concerned, just told her to go to doctors to get a 24 hour monitor. so, the severe headache subsided after she had saline drip and 8 hours in hospital, we assumed it was due to dehydration. we had a light dinner, was about to put her to bed and the headache came back again, 3 hours after getting back from hospital. we called an ambulance again because she couldn't stand for us to take her, however waiting times were long so i laid her down and put a damp towel on her head and massaged her scalp which seemed to soothe it. after an hour and a half, the pain turned to a muzzy feeling and she is managing to doze to sleep so we decided to cancel the ambulance. we were wondering whether the severe headache could be caused by panic attacks as she is obviously under a lot of stress with worrying about test results after surgery and has had panic attacks before with palpitations, but nothing like this. seeing as all of her tests and scans came back clear, albeit some minor problems with liver and heart, it's the only other conclusion we can get to. as soon as i could soothe her head and try to calm her, it was subsiding. anyone have any thoughts? it would be much appreciated for any guidance received."
      ],
      "post_follow_count": 1,
      "post_group": [
        "Headache"
      ],
      "post_like_count": 0,
      "post_reply_count": 0,
      "post_time": "2018-12-07T01:05:00Z",
      "post_title": [
        "thunderclap headache"
      ],
      "post_url": [
        "https://patient.info/forums/discuss/thunderclap-headache-687854"
      ],
      "symptoms": [
        "Pain",
        "headache severe",
        "Headache",
        "Upset stomach",
        "Muzzy headed"
      ]
    },
    {
      "_version_": 1760665068575391744,
      "diagnostic_procedures": [
        "Electrocardiogram",
        "angiogram",
        "Holter Electrocardiography",
        "Electrocardiography"
      ],
      "diseases": [
        "Transient hypogammaglobulinemia of infancy",
        "Brachial Amyotrophic Diplegia",
        "Myocardial Infarction"
      ],
      "id": "1647be66-c205-4101-bca6-a45dc9983a77",
      "post_author": "amanda94689",
      "post_author_profile": "https://patient.info/forums/profiles/amanda94689-1148765",
      "post_comments": [
        " I should also say I’m 34 yrs old Sounds like your just panicking about it now that’s what I done and best thing you will ever do is stop smoking that could be the main cause of your pain your body could be telling you it’s had enough  Have you had an angiogram? That will see if you have any blocked arteries , but give up smoking and cut down coffee "
      ],
      "post_content": [
        "so since dec 31st of this year i have had problems first it started with head pressure really bad to the point were i got ct from hospital and dirreaha then chest pains came with it with the head pressure dirreaha ekg blood test fine.. head pressure is gone vision is still on and off and head pain on and off chest pains back pain left arm pain shortness of breath especially on excretion i am a smoker i have been to the hospital countless of times ekgs probably 6-7 times blood tests every time nothing holter monitor for 2 days nothing could this be cardiac the only other thing i'm thinking is my ducts having them cleaned tomorrow to make sure it's not that i do have a cardiology appt on the 20 of april i just want to feel normal again and scared this could be something like i have had symptoms of heart attack and had them ruled out even on the monitors with chest pains nothing i'm at my wits end my heart beat before i could have a coffe smoke sit down at drs office it be no more then 92 most of the time 88 now it's 103 my resting heart rate is 72-74 but when i'm just walking around normal things i used to do it's 120-140 sometimes 150 i always feel my heart beat mostly don't remember ever feeling it before except if i ran or excersiced anyways insight would be great"
      ],
      "post_follow_count": 3,
      "post_group": [
        "Cardiac Arrhythmias"
      ],
      "post_like_count": 0,
      "post_reply_count": 6,
      "post_time": "2018-03-30T13:07:00Z",
      "post_title": [
        "should i be worried"
      ],
      "post_url": [
        "https://patient.info/forums/discuss/should-i-be-worried-647747"
      ],
      "symptoms": [
        "Chest Pain",
        "Pain",
        "Dyspnea",
        "Cardiovascular symptoms",
        "head pressure",
        "Arm Pain",
        "Back Pain",
        "Headache"
      ]
    },
    {
      "_version_": 1760665085443833856,
      "diagnostic_procedures": [
        "angiogram",
        "Diagnosis",
        "Diagnostic radiologic examination",
        "Plain x-ray",
        "Radiographic imaging procedure"
      ],
      "diseases": [
        "Acute lower respiratory tract infection",
        "Microvascular Angina",
        "Myocardial Infarction",
        "Lower respiratory tract infection",
        "Angina Pectoris, Variant",
        "Cardiac Arrhythmia",
        "Harlequin Fetus",
        "Communicable Diseases",
        "Wasting"
      ],
      "id": "2ac510bc-4eab-4d09-8458-df0d3180a17e",
      "post_author": "nick100553",
      "post_author_profile": "https://patient.info/forums/profiles/nick100553-754530",
      "post_comments": [
        " i would ask about prinzmetal angina or syndrome x angina, also there are a number of muscle lining and chest infections that can casue similar sypmtoms. Your GP amy not be too aware of Prinzmeatl but worth a try also if in heart or heart area chest pain and it does last then you wont be wasting anyones time unless you dont get help...worth disucssing all the options with GP and cardilogist (I have Prinzmetal and syndrome x (along with intermitent Arrhythmia and ME...) I would stress stronlgy if in pain and it doenst clear with GTN then call for assistance but if either of the above anginas thne it may be a challange getting diagnosis and help if an infection then antibiotics will see you right ... get an Xray eyc to be sure, again ask them questions ... Good luck!!!! hope it goes well and you do indeed get better soon!!!!! Hi nick, Is there a pattern to your chest pain, like does it come on between 8pm -8am ? Not a lot of people know this but GTN is also prescribed for indigestion, I'm not suggesting that's what it is but just thought I'd throw that into the works, Your GP would of given you a simpler form of medication for that, one that doesn't leave a person with a thumping headache from the GTN :) I see you said, no signifiicant narrowing, this could be the start of angina for you as that's what was said to me years ago \"no significant narrowing\" but 2 years later I had another Angiogram and a 50-60 % occlussion was found in my right coronary artery. You also mentioned about having a drink or 2 in the evening, perhaps this is your bodies way of relaxing after a couple of drinks ?"
      ],
      "post_content": [
        "hello all, wonder if someone can help me. i have been to the hospital on 3 occasions in the last 2 years because i have felt unwell and have suffered [b]minor chest pain[/b] each time the hospital has been very careful and carried blood tests etc which have all been clear of a heart attack. i have also had an angiogram which showed no significant narrowing of arteries. i have recently been getting some mild chest pain again more like little twinges along with longer periods of a heavy or tight feeling. the doctor has given me a tnt spray which so far i have only used twice both times it has seemed to improve the tightness but not completly, the doctor said that if it didnt go after 10mins to call 999, but surely it cant be a heart attack as its been going on for days ? i normally have a drink or two in the evening and without fail the tightness goes, is this because the blood is thinning ? i really dont want to waste the hospitals time if it is just stress of just a chest infection, any advice ? nick"
      ],
      "post_follow_count": 4,
      "post_group": [
        "Angina"
      ],
      "post_like_count": 0,
      "post_reply_count": 6,
      "post_time": "2015-06-12T12:37:00Z",
      "post_title": [
        "help is this angina ?"
      ],
      "post_url": [
        "https://patient.info/forums/discuss/help-is-this-angina--437354"
      ],
      "symptoms": [
        "Angina Pectoris",
        "Chest Pain",
        "Cardiac pain",
        "Dyspepsia",
        "Pain",
        "Cachexia",
        "Headache"
      ]
    }
  ],
  "disea": [
    "Harlequin Fetus",
    "Pneumocystis jiroveci pneumonia",
    "Disease",
    "Acne Vulgaris",
    "Progressive Disease",
    "Esophageal Achalasia",
    "Lyme Disease",
    "angina attack",
    "Chromosome 2q32-Q33 Deletion Syndrome",
    "Decompression Sickness"
  ],
  "syos": [
    "Malaise",
    "Seizures",
    "Convulsions",
    "Signs and Symptoms",
    "Catch - Finding of sensory dimension of pain",
    "Weakness",
    "Sore to touch",
    "Sore skin",
    "Exhaustion",
    "Tremor"
  ]
}
